2sayle/NFC-with-STM32L476/Core/Src/st25r3911b_hal_driver.c
    /* Send data */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, txBuf, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Receive data */
    if (HAL_SPI_Receive(&hspi1, regDataArray, len, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    SPI1_SET_NSS();

    return ST25R_OK;

}


/**
 * @brief Load the FIFO of the ST25R3911B
 * 
 * @param pData Pointer to the data buffer
 * @param len Length of the data buffer
 * @return byte ST25R_OK if the FIFO has been loaded successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */

byte ST25R_LoadFifo(byte *pData, byte len) {

    /* Local variables */
    byte txBuf[FIFO_SIZE + 1] = {0};

    /* Assert parameters */
    if ((pData == NULL) || (len == 0)) {
        return ST25R_WRONG_PARAMETER;
    }
    if (len > FIFO_SIZE) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Prepare buffer */
    txBuf[0] = ST25R_FIFO_LOAD;
    memcpy(&txBuf[1], pData, (size_t)len);

    /* Send data stream to the FIFO */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, txBuf, len+1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    SPI1_SET_NSS();

    return ST25R_OK;

}


/**
 * @brief Read the FIFO of the ST25R3911B
 * 
 * @param pData Pointer to the data buffer
 * @param len Pointer to the length of the data buffer
 * @return byte ST25R_OK if the FIFO has been read successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_FIFO_EMPTY_ERROR if the FIFO is empty
 * @return byte ST25R_FIFO_UDFLOW_ERROR if an underflow occurs
 * @return byte ST25R_FIFO_OVFLOW_ERROR if an overflow occurs
 * @return byte ST25R_PARITY_FRAMING_ERROR if a parity or framing error occurs
 */

byte ST25R_ReadFifo(byte *pData, byte *len) {

    /* Local variables */
    byte regData = 0;
    byte fifoLen = 0;
    byte flag = ST25R_FIFO_READ;

    /* Assert parameters */
    if ((pData == NULL) || (len == 0)) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Get number of bytes to be read in FIFO */
    if (ST25R_ReadRegister(ST25R_FIFO1_STATUS_REG, &fifoLen) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    } 

    /* Check FIFO status register 1 */
    if (fifoLen == 0x00) {
        return ST25R_FIFO_EMPTY_ERROR;
    }
    if (fifoLen > FIFO_SIZE) {
        return ST25R_UNKNOWN_ERROR;
    }

    /* Check FIFO status register 2 */
    if (ST25R_ReadRegister(ST25R_FIFO2_STATUS_REG, &regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    if (regData & 0x40) {
        return ST25R_FIFO_UDFLOW_ERROR;
    }
    if (regData & 0x20) {
        return ST25R_FIFO_OVFLOW_ERROR;
    }

    /* Store info */
    fifo_np_lb = regData & 0x01;
    if (fifo_np_lb) {
        return ST25R_PARITY_FRAMING_ERROR;
    }

    fifo_ncp = (regData & 0x10) >> 4;

    /* FIFO_NOT_COMPLETE flag */
    if (fifo_ncp) {
        fifo_lb = (regData & 0x0E) >> 1;
    }
    else {
        fifo_lb = 0;
    }

    /* Send read fifo byte command */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, &flag, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    
    /* Read fifo */
    if (HAL_SPI_Receive(&hspi1, pData, (ushort)fifoLen, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    SPI1_SET_NSS();

    return ST25R_OK;

}

/**
 * @brief Send a direct command to the ST25R3911B
 * 
 * @param cmd Command to be sent
 * @return byte ST25R_OK if the command has been sent successfully
 * @return byte ST25R_WRONG_PARAMETER if the command is not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */

byte ST25R_SendDirectCommand(byte cmd) {
    
    /* Assert parameter */
    if (((cmd > 0xE3)|| (cmd < 0xC1)) && (cmd != 0xFC) && (cmd != 0xD2))  {
        return ST25R_WRONG_PARAMETER;
    }

    /* Add appropriate mask */
    cmd |= ST25R_DIRECT_CMD;

    /* Send command */
    SPI1_RESET_NSS();
    if (HAL_SPI_Transmit(&hspi1, &cmd, 1, MAX_SPI_TIMEOUT) != HAL_OK) {
        SPI1_SET_NSS();
        return ST25R_SPI_IO_STREAM_ERROR;
    }
    SPI1_SET_NSS();

    return ST25R_OK;
}


/**
 * @brief Set a bit in a register of the ST25R3911B
 * 
 * @param addr Address of the register
 * @param pos Position of the bit to be set
 * @return byte ST25R_OK if the bit has been set successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 */

byte ST25R_SetBitInRegister(byte addr, byte pos) {

    /* Assert parameters */
    if (addr > MAX_ADDR_NUMBER) {
        return ST25R_WRONG_PARAMETER;
    }
    if (pos > 7) {
        return ST25R_WRONG_PARAMETER;
    }


    /* Local variables */
    byte regData = 0;

    /* Read register */
    if (ST25R_ReadRegister(addr, &regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Set bit */
    ST25R_SET_BIT(regData, pos);

    /* Write register */
    if (ST25R_WriteRegister(addr, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    return ST25R_OK;
}

/**
 * @brief Clears a bit in a register of the ST25R3911B
 * 
 * @param addr Address of the register
 * @param pos Position of the bit to be reset
 * @return byte ST25R_OK if the bit has been reset successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 *
 */
byte ST25R_ClearBitInRegister(byte addr, byte pos) {
    /* Assert parameters */
    if (addr > MAX_ADDR_NUMBER) {
        return ST25R_WRONG_PARAMETER;
    }
    if (pos > 7) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Local variables */
    byte regData = 0;

    /* Read register */
    if (ST25R_ReadRegister(addr, &regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Reset bit */
    ST25R_RESET_BIT(regData, pos);

    /* Write register */
    if (ST25R_WriteRegister(addr, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    return ST25R_OK;
}

/**
 * @brief Modify a register of the ST25R3911B
 * 
 * @param addr Address of the register
 * @param value Value to be written in the register
 * @param mask Mask to be applied to the register
 * @return byte ST25R_OK if the register has been modified successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 */
byte ST25R_ModifyRegister(byte addr, byte value, byte mask) {
    /* Local variables */
    byte regData = 0;

    /* Read register */
    if (ST25R_ReadRegister(addr, &regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    /* Modify register */
    ST25R_MODIFY_REG(regData, value, mask);

    /* Write register */
    if (ST25R_WriteRegister(addr, regData) != ST25R_OK) {
        return ST25R_SPI_IO_STREAM_ERROR;
    }

    return ST25R_OK;
}






/**
 * @brief Check the presence of the ST25R3911B
 * 
 * @return byte ST25R_OK if the ST25R3911B is present
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 */
byte ST25R_CheckIC(void) {
    /* Local variables */
    byte status = ST25R_OK;
    byte regData = 0;

    /* Read the version register */
    status = ST25R_ReadRegister(ST25R_IC_IDENTITY_REG, &regData);
    if (status != ST25R_OK) {
        return status;
    }

    if ((regData & 0x08) != 0x08) {
        return ST25R_UNKNOWN_ERROR;
    }

