2sayle/NFC-with-STM32L476/Core/Src/st25r3911b_hal_driver.c
        }

        /* Fill the FIFO with the remaining bytes */
        status = ST25R_LoadFifo(pData, nbLeftBytes);
        if (status != ST25R_OK) {
            return status;
        }

        /* Send the data */
        if (crcOption == TX_CRC_ON) {
            status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITH_CRC_CMD);
        } else {
            status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WITHOUT_CRC_CMD);
        }

        /* Wait for the end of transmission */
        if (WaitForSpecificIRQ(ST25R_TX_STOP_IRQ) != ST25R_OK) {
            return ST25R_IRQ_ERROR;
        }

    }

    return ST25R_OK;

}


/**
 * @brief Receive data from the PICC
 * 
 * @note This function is used to receive bytes from the PICC
 * regardless of the selected protocol.
 * 
 * @param pData Pointer to the data buffer
 * @param len Pointer to the length of the data buffer
 * @param timeout Timeout for the reception
 * 
 * @return byte ST25R_OK if the data has been received successfully
 * @return byte ST25R_WRONG_PARAMETER if the parameters are not valid
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 * @return byte ST25R_FIFO_OVFLOW_ERROR if an overflow occurs
 * @return byte ST25R_FIFO_UDFLOW_ERROR if an underflow occurs
 * @return byte ST25R_FIFO_EMPTY_ERROR if the FIFO is empty
 */
byte ST25R_ReceiveData(byte *pData, ushort *len) {

    /* Assert parameters */
    if (pData == NULL) {
        return ST25R_WRONG_PARAMETER;
    }

    /* Clear length parameter */
    *len = 0;

    /* Local variables */
    byte status = ST25R_OK;
    byte nbOfReadBytes = 0;

    /* Case 1. More than FIFO_SIZE bytes to read */
    if (CheckForSpecificIRQ(ST25R_FIFO_WATER_LVL_IRQ) == ST25R_OK) {

        /* Read bytes until End of Reception IRQ */
        do {
            /* Read FIFO */
            status = ST25R_ReadFifo(pData, &nbOfReadBytes);
            if (status != ST25R_OK) {
                return status;
            }

            /* Update parameters */
            pData += nbOfReadBytes;
            *len += nbOfReadBytes;

        } while (CheckForSpecificIRQ(ST25R_RX_STOP_IRQ) != ST25R_OK);

        /* Replace the pointer to its first value */
        pData -= *len;

    }

    /* Case 2. Less than FIFO_SIZE bytes to read */
    else if (CheckForSpecificIRQ(ST25R_RX_STOP_IRQ) == ST25R_OK) {
        status = ST25R_ReadFifo(pData, nbOfReadBytes);
        if (status != ST25R_OK) {
            return status;
        }

        /* Update length */
        *len = nbOfReadBytes;
    }
    
    return ST25R_OK;

}


/* ISO14443A functions */

/**
 * @brief Transmit a REQA command to the ST25R3911B
 * 
 * @note This function is used to initiate a communication with a PICC (Proximity Integrated Circuit Card) in ISO14443A mode.
 * 
 * @return byte ST25R_OK if the REQA command has been transmitted successfully
 * @return byte ST25R_SPI_IO_STREAM_ERROR if an error occurs during SPI communication
 * @return byte ST25R_IRQ_ERROR if an error occurs during IRQ handling
 * @return byte ST25R_UNKNOWN_ERROR if an unknown error occurs
 */
byte ST25R_TransmitREQA(void) {

    /* Local variables */
    byte status = ST25R_OK;
    byte regData = 0;

    /* Set no_crc_rx bit in Auxiliary Definition register */
    status = ST25R_SetBitInRegister(ST25R_AUX_DEF_REG, 7);
    if (status != ST25R_OK) {
        return status;
    }

    /* Send the REQA command */
    status = ST25R_SendDirectCommand(ST25R_TRANSMIT_REQA_CMD);
    if (status != ST25R_OK) {
        return status;
    }
    /* Wait for the end of transmission */
    if (WaitForSpecificIRQ(ST25R_TX_STOP_IRQ) != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }

    /* Read the FIFO */
    status = ST25R_ReadFifo(&regData, fifo_lb);
    if (status != ST25R_OK) {
        return status;
    }

    /* Check the response */
    if (regData != 0x04) {
        return ST25R_UNKNOWN_ERROR;
    }

    return status;
}


byte ST25R_TransmitWUPA(void) {
    /* Local variables */
    byte regData = 0;
    byte status = 0;

    /* Send WUPA command */
    status = ST25R_SendDirectCommand(ST25R_TRANSMIT_WUPA_CMD);
    if (status != ST25R_OK) {
        return status;
    }
    /* Wait for the end of transmission */
    if (WaitForSpecificIRQ(ST25R_TX_STOP_IRQ) != ST25R_OK) {
        return ST25R_IRQ_ERROR;
    }



}
byte ST25R_TransmitAnticollA(void);
byte ST25R_PerformAnticollA(void);

/* ISO14443B functions */

